import java.util.Scanner;

public class HomeWork01 {
    public static void main(String[] args) {

        Ternar t = new Ternar();                         //1.1 ДЗ
        Romb r = new Romb();                             //1.2
        Exponentiation e = new Exponentiation();         //1.3
        Fibonachi f = new Fibonachi();                   //1.4
        Sort s = new Sort();                             //1.5

        Scanner sc = new Scanner(System.in);
        System.out.println("Выберите номер задания для выполнения: \n" +
                "\t 1 - Исход матча \n" +
                "\t 2 - Ромб \n" +
                "\t 3 - Возведение в степень \n" +
                "\t 4 - Число Фибоначчи\n" +
                "\t 5 - Факториал \n" +
                "\t 6 - Сортировки \n");
        int n = sc.nextInt();
        switch (n) {
            case 1:
                t.runTernarFunction();
                break;
            case 2:
                r.runRomb();
                break;
            case 3:
                e.runExp();
                break;
            case 4:
                f.runFibonachi();
                break;
            case 5:
                f.runFactorial();
                break;
            case 6:
                s.measure();
                break;
            default:
                System.out.println("Ошибка ввода");
                break;
        }
    }
}
/*
1 Установите CheckStyle Plugin for Intellij IDEA. Это поможет при написании и поддержании кода в хорошем тоне.
1.1 С помощью тернарного оператора написать функцию, которая будет считать исход матча. Метод будет принимать
4 параметра и возвращать целое число. Футбольный матч.
 4 параметра метода - результат матча и то, что поставил пользователь.
  Пример: 0,2,1,1. Что значит: команды сыграли в счёт 0:2, а пользователь ставил 1:1.
   Задача: если пользователь угадал 100% результат - возвращать 2, если угадал, что выиграла какая-либо команда
   (пр. сыграли 1:2, а ставил 0:3 - то пользователь у выиграше), то возвращать 1, если не угадал ничего - возвращать 0.

1.2 Нарисовать ромб с звёздочек заданной величины. Пример: величина 3, значит максимальное кол-во звёзд в ряду будет 3
1.3 Возвести число в квадрат, куб, степень
1.4 Фибоначчи, факториал, Ряд Тейлора (рекурсии)
1.5 Каждую из сортировок испытать на массиве величиной в 1000000 и подсчитать время выполнения
1.6 Различные задачи с матрицами (диагональ, минимальные максимальные эл, сортировка, и пр)
1.7 Реализовать каждый из Object методов, в частности - метод clone().

Задания 1, 1.1, 1.2, 1.3, 1.5 обязательно. Пункт 1.4 делаете два первых пункта, ряд Тейлора - по желанию.
 */