import java.util.Scanner;
/*
1.2 Нарисовать ромб с звёздочек заданной величины.
Пример: величина 3, значит максимальное кол-во звёзд в ряду будет 3
*/

public class Romb {

    public void runRomb() {
        System.out.println("Введите размер ромба: ");
        Scanner sc = new Scanner(System.in);
        int size = sc.nextInt();

// верхняя часть
        for (int i = 1; i < size; i++) {
            for (int j = size; j > i; j--) {
                System.out.print(" ");
            }
            for (int j = 1; j < 2 * i; j++) {
                System.out.print("*");
            }
            System.out.println();
        }
// нижняя часть
        for (int i = size; i >= 1; i--) {
            for (int j = size; j > i; j--) {
                System.out.print(" ");
            }
            for (int j = 1; j < i * 2; j++) {
                System.out.print("*");
            }
            System.out.println();
        }
    }
}
        /*для наглядности работы алгоритма представим ромб как сумму
         четырех прямоугольных треугольников, таким образом нам надо вывести в консоль
         последовательно 4 квадрата из пробелов и звездочек:
         для примера рассмотрим ромб размером грани 4:
        ___*___
        __***__
        _*****_
        *******
        _*****_
        __***__
        ___*___
        рассмотрим как он строится:
         _ _ _ * (3 пр 1 *  -     3 пр) _ _ _
         _ _ * * (2 пр 2 *  - 1 * 2 пр) * _ _
         _ * * * (1 пр 3 *  - 2 * 1 пр) * * _
         * * * * (     4 *  - 3*      ) * * * - после этой линии
          алгоритм повторяется в обратной последовательности
         _ * * * (1 пр 3 *  - 2 * 1 пр) * * _
         _ _ * * (2 пр 2 *  - 1 * 2 пр) * _ _
         _ _ _ * (3 пр 1 *  -     3 пр) _ _ _

         сразу видно, что для строки  № n (номер строки)  -> №  size (размер грани ромба)
         выводится вначале (верхняя часть ромба) :
          (слева) (size - n) пробелов + n *         +     (справа) (n - 1) * + (size - n) пробелов + перенос строки
         затем нижняя часть ромба:
          (слева) (n - size ) пробелов + (2*size - n)* +  (справа) (2*size - n - 1) * + (n - size ) пробелов + перенос строки

        можем сразу упростить  - не выводя пробелы справа(сразу перенос строки)
        и обединив знаки *, получим:
        сверху
        (size - n) пробелов + 2 * n знаков "*"
        снизу
        (n - size ) пробелов + 2 *(2* size - n) - 1
        поскольку    выводить нижнюю часть мы будем после построения верхней отдельным циклом,
        то и количество звезд рассчитаем по формуле 2(size - n) - 1 (-1 -т.е. переменная строго меньше номера строки)
        */